//乘号，除号，取余运算符的优先级为3；加号，减号的优先等级为4；赋值运算符的优先等级为14
#include <stdio.h>
int main(void)
{
	//算数运算符
	printf("%d, %lf\n", 5/2, 5.0/2);	//如果操作数都是整型，结果为整型；操作数为浮点型，结果浮点型

	int a;
	printf("%d\n",a = 3.98);	//把浮点型数据赋值给整型变量，丢失小数部分

	printf("%d,%d\n",5%2, 4%2);	//同号取余
	//printf("%d\n",3.0%2);		//error 取余两边必须为整型
	printf("%d,%d,%d\n", -13%3, 13%-3, -13%23);		//异号取余
	//赋值运算符
	int b = 1, c = 7;
	printf("%d\n", b += 2);	// += 等价于 b=b+2
	printf("%d\n", c /= 2);	// /= 等价于 c = c/2;还有= *= %= >>= <<= &= ^= |= 与之类似
// b + c =100				//error ,因为赋值运算符的左操作必须是一个左值(变量),b+c只是一个值,并不是变量
	a = 1, b = 2, c = 3;
	printf("%d\n",(a = b) = c);	//赋值表达式的值是左操作数最终的值，这个值为一个左值
	return 0;
}